# Date: 28.06.2021
# Author: Lev Dolgikh

# Hello World (по книге Майкла Доусона)
# Демонстрирует работу функции print

print ("Hello World")
print ("\nHello\nWorld")

print ("Ковычки 'Внутри' Ковычек")

print ("Объединяем", "Несколько", "Строк")

print ("Печатаем",
       "так, что бы было",
       "красиво и побольше")
print ("Вот", end=" ")
print ("оно")
print ("""
     _     _     ______     _          _          ______
    | |   | |   | _____|   | |        | |        |  __  |
    | |   | |   | |        | |        | |        | |  | |
    | |___| |   | |____    | |        | |        | |  | |
    | |___| |   | _____|   | |        | |        | |  | |
    | |   | |   | |        | |        | |        | |  | |
    | |   | |   | |____    | |____    | |____    | |__| |
    |_|   |_|   |______|   |______|   |______|   |______|
    
    _                 _     ______     ______     _          _
    \ \              / /   |  __  |   |  __  |   | |        |  \   
     \ \            / /    | |  | |   | |  | |   | |        |   \  
      \ \          / /     | |  | |   | |__| |   | |        | |\ \ 
       \ \        / /      | |  | |   |   ___|   | |        | | | |
        \ \  /\  / /       | |  | |   |   \      | |        | |/ /  
         \ \/  \/ /        | |__| |   | |\ \     | |____    |   /  
          \__/\__/         |______|   |_| \_\    |______|   |__/   
""")

input ("\n\nНажмите Enter. чтобы выйти.")
