# Date: 28.06.2021
# Author: Lev Dolgikh

# Забавные строки (по книге Майкла Доусона)
# Демонстрирует сцепление и повторение строк

print ("Две строки можно " + "сцепить с помощью оператора '+'.")
print ("\nЭта строка " + "вряд ли " + "удив" + "ит вас " \
        + "Но интересно. " + "что " + "она - \n" + "одна длинная-длин" \
        +"на" +"я" + " строка, сцепленная " \
        + "из " + "двадцати двух\n" + "отдельных строк, разбитых " \
        +"на шесть строк."+" Достаточно ли вы"+" впечатлены? " +"Ну хватит.\n" \
        +"вот "+"наша "+"длинная"+" строка и закончилась!")

# Повторение строки 10 раз
print ("\nПирожные " * 10)

input ("Нажмите \"Enter\", что бы выйти")
