# Date: 28.06.2021
# Author: Lev Dolgikh

# Воображаемые благодарности (по книге Майкла Доусона)
# Рассмотрение escape-последовательностей

print ("\t\t\tВоображаемые благодарности")
print ("\t\t\t \\ \\ \\ \\ \\ \\")
print ("\t\t\tразработчика игры")
print ("\t\t\tМайкла Доусона")
print ("\t\t\t \\ \\ \\ \\ \\ \\")
print ("моему парикмахеру Генри по прозвижу \'Великолепный\', который не знает слово \"невозможно\".")

# Звучит системный динамик
print ("\a")

input ("Нажмите \"Enter\", что бы выйти")
