# Date: 28.06.2021
# Author: Lev Dolgikh

# Математика
# Демонстрирует математические операции

print ("1) Два автомобиля движутся парралельно друг другу в одном направлении," \
       ,"\nскорость первого автомобиля 30 м/с. Какая скорость второго автомобиля," \
       ,"\nесли за одинаковый промежуток времени он проходит расстояние в 2 раза больше," \
       ,"\nчем первый автомобиль")
input ("\nНажмите любую клавишу, что бы узнать ответ")
print ("\nОтвет: ", 30*2, "м/с", end="\n\n")

print ("2) В полной семье 7 детей, отец после тяжелого трудового дня принес 24 пряника," \
       ,"\nсколько пряников достанеться каждому члену семьи? сколько пряников останется добавкой?")
input ("\nНажмите любую клавишу, что бы узнать ответ")
print ("\nОтвет: каждому достанется по ", 24//9, " пряника (папа и мама тоже хотят кушать!),\nостанется добавкой: ", 24%9, " пряника")

input ("\nНажмите \"Enter\", что бы выйти")
